---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.CircuitNumber
source: html/6897007d-92e0-c187-7fcb-bf83ebec4d93.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.CircuitNumber Property

The CircuitNumber of the Electrical System.

## Syntax (C#)
```csharp
public string CircuitNumber { get; }
```

## Remarks
This property is used to retrieve the CircuitNumber of the Electrical System.